Beyzaydinn/LifeLine/firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_USB_OTG_SUPPORTED=y

# AES hardware acceleration (course requirement)
CONFIG_MBEDTLS_HARDWARE_AES=y

# USB CDC for PC communication
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_CDC_COUNT=1
CONFIG_TINYUSB_TASK_STACK_SIZE=4096

# Console on UART (USB-UART bridge on DevKit) — protocol uses native USB OTG CDC
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_USB_CDC=n

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
